// import '../models/product.dart';

// List<Product> products = [
//   Product(
//     name: "Zork",
//     description:
//         "هو مبيد حشري جديد يتميز بطريقة عمل حديثة ومتميزة، مما يجعله فعالًا على مدى واسع من الآفات الحشرية التي تصيب العديد من المحاصيل الحقلية والخضر والفاكهة",
//     image: 'assets/services/zork.jpg',
//     price: 2700,
//     unit: 'SDG',
//     rating: 4.35,
//   ),
//   Product(
//     name: "Fusilade",
//     description:
//         "مبيد أعشاب إختياري يستعمل بعد الإنبات لمكافحة النجيلة والحشائش رفيعة الأوراق في المحاصيل الحقلية (الفول المصري الفول السوداني -الشمار _البرسيم) بالإضافة للمحاصيل البستانية كالبصل والموز والبطاطس  وغيرها من المحاصيل عريضة الأوراق .يبدأ ظهور أثر المبيد خلال يومين  بتوقف نمو الحشائش وبعد ذلك   تغير لونها للأحمر  القاني ويكتمل موت الحشائش خلال ٣_٤  أسابيع",
//     image: 'assets/services/fus.jpg',
//     price: 1200,
//     unit: 'SDG',
//     rating: 3.86,
//   ),
//   Product(
//     name: "Sureshot",
//     description:
//         "مـاده لاصقه وناشـرة تستعمل لزياده انتشار المبيد علي السطح المعامل كما يعمل علي تسهيل اختراق المبيد ويسهل اختراق المبيد للطبقه الشمعيــه الموجوده علي اجسام بعض الحشرات والنباتات قابل للخلط مع كل المبيدات الحشريـه والحشائشيه والفطريه والاسمده الورقيه",
//     image: 'assets/services/shot.jpg',
//     price: 8000,
//     unit: 'SDG',
//     rating: 4.18,
//   ),
//   Product(
//     name: "Cruiser",
//     description:
//         "لمعفرات تعمل علي وقاية المحصول من مخاطر الحشرات و الأمراض الفطرية التي قد تصيبها عند الإنبات ومراحل النمو الأول معظم معفرات البذور تعطي حماية للمحصول من آفات العسلة والأرضة لفترة تتراوح بين 45-60 يوم مما يقلل الاصابه",
//     image: 'assets/services/crusir.jpg',
//     price: 14000,
//     unit: 'SDG',
//     rating: 5.0,
//   ),
//   Product(
//     name: "Sactin",
//     description:
//         "يستخدم مبيد سقنت بشكل شائع لعلاج الآفات داخل الشقوق. يستخدم في السيطرة على العديد من الآفات مثل العناكب والدبابير والنمل (بما في ذلك النمل الناري) والبراغيث والبق الصراصير والنمل الأبيض والخنافس والعقارب",
//     image: 'assets/services/sactin.jpg',
//     price: 17000,
//     unit: 'SDG',
//     rating: 5.0,
//   ),
//   Product(
//     name: "Apron",
//     description:
//         "سماد عضوي واغذية نباتية لتعويض نقص الحديد من اسبوما (كلوروسيس) - 3-0-3 5 باوند. شنطة. يتحول من اللون الأصفر إلى الأخضر، ولا يسبب بقع",
//     image: 'assets/services/apron.jpg',
//     price: 3000,
//     unit: 'SDG',
//     rating: 3.22,
//   ),
// ];
